Revit 2027 API
ExporterIFC.SetOwnerHistoryHandle Method
 Sets the handle to the IfcOwnerHistory for the file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOwnerHistoryHandle(
	IFCAnyHandle ownerHistory
)
Public Sub SetOwnerHistoryHandle (
	ownerHistory As IFCAnyHandle
)
public:
void SetOwnerHistoryHandle(
	IFCAnyHandle^ ownerHistory
)
member SetOwnerHistoryHandle :
        ownerHistory : IFCAnyHandle -> unit
Parameters
ownerHistory IFCAnyHandle
 The handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace